Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFK144.PIC
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="EMDC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="RH12"/>
      <edc:VirtualPin edc:name="ECRS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 101-->
      <edc:VirtualPin edc:name="RH13"/>
      <edc:VirtualPin edc:name="ECRSDV"/>
      <edc:VirtualPin edc:name="ERXDV"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 102-->
      <edc:VirtualPin edc:name="RH14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 103-->
      <edc:VirtualPin edc:name="RH15"/>
      <edc:VirtualPin edc:name="EBIA23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 104-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RPD0" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 105-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 106-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 107-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 108-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 109-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RPD1" edc:ppsgroup="4" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 110-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="RPD2" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBID14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 111-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBID15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 112-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="RPD12" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="EBID12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 113-->
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="EBID13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 114-->
      <edc:VirtualPin edc:name="RJ0"/>
      <edc:VirtualPin edc:name="ETXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 115-->
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="EMDIO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 116-->
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="EBIRDY3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 117-->
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="EBIA22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 118-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="RPD4" edc:ppsgroup="3" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SQICS0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 119-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="RPD5" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SQICS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 120-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="RPD6" edc:ppsgroup="1" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 121-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="RPD7" edc:ppsgroup="2" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 122-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 123-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 124-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="RPF0" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="EBID11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 125-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="RPF1" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="EBID10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 126-->
      <edc:VirtualPin edc:name="RK7"/>
      <edc:VirtualPin edc:name="EBIA21"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 127-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="RPG1" edc:ppsgroup="1" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="EBID9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 128-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="RPG0" edc:ppsgroup="2" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="EBID8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 129-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="SQICLK"/>
      <edc:VirtualPin edc:name="TRCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 130-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="SQID3"/>
      <edc:VirtualPin edc:name="TRD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 131-->
      <edc:VirtualPin edc:name="RJ4"/>
      <edc:VirtualPin edc:name="EBICS0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 132-->
      <edc:VirtualPin edc:name="RJ5"/>
      <edc:VirtualPin edc:name="EBICS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 133-->
      <edc:VirtualPin edc:name="RJ6"/>
      <edc:VirtualPin edc:name="EBICS2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 134-->
      <edc:VirtualPin edc:name="RJ7"/>
      <edc:VirtualPin edc:name="EBICS3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 135-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="EBID0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 136-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 137-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 138-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="EBID1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 139-->
      <edc:VirtualPin edc:name="RG14"/>
      <edc:VirtualPin edc:name="SQID2"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 140-->
      <edc:VirtualPin edc:name="RG12"/>
      <edc:VirtualPin edc:name="SQID1"/>
      <edc:VirtualPin edc:name="TRD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 141-->
      <edc:VirtualPin edc:name="RG13"/>
      <edc:VirtualPin edc:name="SQID0"/>
      <edc:VirtualPin edc:name="TRD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 142-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="EBID2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 143-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="RPE3" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="EBID3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 144-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="EBID4"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T6CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC7" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U6CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI5" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS6" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T7CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC8" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C1RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T8CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC9" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T9CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC6" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U6RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI6" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI3" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="1" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO5" edc:ppsgroup="1" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS6" edc:ppsgroup="1" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC6" edc:ppsgroup="1" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO4" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="1" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1TX" edc:ppsgroup="1" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="2" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsgroup="2" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6RTS" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="2" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO5" edc:ppsgroup="2" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsgroup="2" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC7" edc:ppsgroup="2" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO1" edc:ppsgroup="2" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsgroup="3" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsgroup="3" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6TX" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS5" edc:ppsgroup="3" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO6" edc:ppsgroup="3" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC8" edc:ppsgroup="3" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="3" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO3" edc:ppsgroup="3" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="4" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5RTS" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6TX" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="4" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO6" edc:ppsgroup="4" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsgroup="4" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsgroup="4" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC9" edc:ppsgroup="4" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2TX" edc:ppsgroup="4" edc:ppsval="15"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
